ask_osurikova/ab_tests/ab.wsgi.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.10.0
Server Hostname:        localhost
Server Port:            80

Document Path:          /question/about
Document Length:        53 bytes

Concurrency Level:      10
Time taken for tests:   1.144 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      251000 bytes
HTML transferred:       53000 bytes
Requests per second:    874.41 [#/sec] (mean)
Time per request:       11.436 [ms] (mean)
Time per request:       1.144 [ms] (mean, across all concurrent requests)
Transfer rate:          214.33 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     2   11   1.7     11      26
Waiting:        2   11   1.7     11      26
Total:          2   11   1.7     11      26

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     11
  75%     11
  80%     12
  90%     13
  95%     13
  98%     14
  99%     24
 100%     26 (longest request)